/***************************************************************
 *************************程序说明*****************************

***************************************************************/

/**************************预处理******************************/


/**************************头函数*****************************/


/**************************************************************************************
 **********定义回调函数:LRESULT CALLBACK WndProc(HWND, UINT, WPARAM, LPARAM);**********
    1、LRESULT 数据类型：指的是从窗口程序或者回调函数返回的32位值
	2、HWND:h是类型描述，表示句柄(handle),Wnd是变量对象描述，表示窗口。HWND表示窗口句柄
	3、消息ID(Message ID) UINT
	4、WPARAM:WORD类型的整形变量；
	5、LPARAM:LONG类型的整形变量。32位，消息响应机制
****************************************************************************************/


/*************************************************************************************
 *******************************定义WINDOW应用程序入口函数****************************
int WINAPI WinMain( HINSTANCE hInstance, HINSTANCE hPrevInstance, PSTR szCmdLine, int iCmdShow)
 *************************************************************************************
     1、HINSTANCE hInstance当前实例
	 2、HINSTACNE hPrevInstance前一个实例
	 3、PSTR szCmdLine传进来的参数
	 4、int iCmdShow显示方式（最大化、最小化、隐藏等）
*************************************************************************************/

{
	//定义static TCHAR szAppName[]、HWND、MSG、WNDCLASS
	

    
	/*****************************************************
	 *********************定义窗口类信息******************
	typedef struct _WNDCLASS {
        UINT style;// 窗口类型
        WNDPROC lpfnWndProc;//窗口处理函数
        int cbClsExtra;//窗口扩展
        int cbWndExtra;//窗口实例扩展
        HINSTANCE hInstance;//实例句柄
        HICON hIcon;//窗口的最小化图标
        HCURSOR hCursor;//窗口鼠标光标
        HBRUSH hbrBackground;//窗口背景色
        LPCTSTR lpszMenuName;//窗口菜单
        LPCTSTR lpszClassName;// 窗口类名
     } WNDCLASS, *LPWNDCLASS;
	*****************************************************/
	//窗口类成员属性
	
    
	//注册窗口类
	

	/*************************************************************
	*****************************创建窗口*************************
	HWND CreateWindow(
        LPCTSTR lpClassName,  //窗口类名
        LPCTSTR lpWindowName, //窗口标题
        DWORD dwStyle,        //窗口风格
        int x,                //窗口初始化显示位置x
        int y,                //窗口初始化显示位置y
        int nWidth，          //窗口宽度
        int nHeight，         //窗口高度
        HWND hWndParent,      //父窗口
        HMENU hMenu，         //菜单句柄，或依据窗口风格指明一个子窗口标识
        HANDLE hlnstance，    //该窗口应用程序的示例句柄
        LPVOID lpParam）；    //指向一个值的指针，该值传递给窗口WM_CREATE消息
	**************************************************************/
	//创建窗口


	//显示窗口
	

	//获取、翻译、分发消息

	
    //msg.wParam 来自一条表示退出的消息，返回这个值给系统，从而退出
	
}

/***************************定义回调函数******************************/

{
	/******************************************************************
	*******return DefWindowProc(hwnd, message,  wParam, lParam);*******
	DefWindowProc是默认的窗口处理函数，我们可以把不关心的消息丢给它处理，
	以确保每一个消息得到处理
	*******************************************************************/
	
}